# SlabShapeEditor Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
Floor..::..SlabShapeEditor Property
Floor Class See Also
---
Get the SlabShapeEditor used for slab shape editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public SlabShapeEditor SlabShapeEditor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SlabShapeEditor As SlabShapeEditor
	Get
```

Visual C++
---
```text
public:
property SlabShapeEditor^ SlabShapeEditor {
	SlabShapeEditor^ get ();
}
```

# Remarks
Only flat and horizontal floor is valid for slab shape edit. Otherwise, ShapeEditor will be nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
Floor Class
Autodesk.Revit.DB Namespace